# #Задача 1: Найдите сумму цифр трехзначного числа. 

# a = input("Введите трехзначное число: ")
# print(int(a[0]) + int(a[1]) + int(a[2]))


# Задача 2: Петя, Катя и Сережа делают из бумаги журавликов. 
# Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, 
# если известно, что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# s = input("Введите сколько журавликов сделали дети: ")
# girl = int(s)//3*2
# boy = int(s)//3//2
# print(boy, girl, boy)

#Задача 3.

# a = input("Введите шестизначный номер билета: ")
# if ((int(a[0]) + int(a[1]) + int(a[2])) == (int(a[3]) + int(a[4]) + int(a[5])) ):
#     print("yes")
# else:   
#     print("no")  

#Задача 4.

# k = int(input("Введите сколько вы хотите отломать долек так, чтобы разломить шоколадку на два прямоугольника: "))
# m = int(input("Введите количество долек по горизонтали "))
# n = int(input("Введите количество долек по вертикали "))
# if (k % m == 0 or k % n == 0) and k < (int(m) * int(n)):
#     print("yes") 
# else:
#     print("no") 
